# replace

p = "Hello"
p = p.replace("lo","p")
print(p)

# replace ფუნქცია გამოიყენება იმისათვის რომ სტრინგში შევცვალოთ რაიმე ასო/ასოები.
# პირველ არგუმენტად გადავცემთ იმ მნიშვნელობას რომლის შეცვლაც გვინდა, მეორე არგუმენტად კი იმას რითიც
# უნდა შევცვალოთ პირველ არგუმენტში გადაცემული მნიშვნელობა.

# join

l = ["Nata", "magaria"]
l = "".join(l)
print(l)

# join ფუნქცია გამოიყენება რაიმე სტრინგების შესაერთბლად, ან მათ შორის რამის დასაწერად.
# ბრჭყალებში გადაცემული მნიშვნელობა მოთავსდება ამ სტრინგებს შორის.
