// 1
// შექმენით arrow function, რომელიც იღებს ერთი პარამეტრს (სახელი) და აბრუნებს „გამარჯობა,
// [სახელი]!“. თუ პარამეტრი არ არის მოცემული, გამოიყენეთ "მაყურებელი" როგორც დეფოლტი.
let hello = (name = "guest") => `hello, ${name}`;
console.log(hello("nata"));

// 2 
// შექმენით arrow function, რომელიც იღებს ორი პარამეტრს (a, b) და აბრუნებს მათ ჯამს.
// თუ პარამეტრები არ არის მოცემული, გამოიყენეთ 0 და 5 როგორც დეფოლტი მნიშვნელობები.
let sum = (a=0, b=5) => a+b;
console.log(sum(4,5));

// 3
// შექმენით arrow function, რომელიც იღებს ორი რიცხვს და აბრუნებს მეტს მათ შორის.
//  თუ პარამეტრები არ არის მოცემული, გამოიყენეთ 10 და 20 როგორც დეფოლტი მნიშვნელობები.
let greater = (x=10,y=20) => Math.max(x, y);
console.log(greater());

// 4
// შექმენით arrow function, რომელიც იღებს სამი პარამეტრს და აბრუნებს მათ გამრავლებას.
// თუ პარამეტრები არ არის მოცემული, გამოიყენეთ 1, 2 და 3 როგორც დეფოლტი მნიშვნელობები.
let mult = (c=1,d=2,e=3) => c*d*e;
console.log(mult());

// 5
// შექმენით arrow function, რომელიც იღებს ორ პარამეტრს (ფასს და გადასახადს) და აბრუნებს
// საბოლოო ფასს (ფასი + გადასახადი). თუ გადასახადი არ არის მოცემული, გამოიყენეთ 5% როგორც დეფოლტი.
let total = (price,tax=0.05) => price + price * tax;
console.log(total(4));

// 6
// შექმენით arrow function, რომელიც იღებს ტექსტს და რიცხვს და აბრუნებს ტექსტის გამეორებას მოცემული
// რიცხვის რაოდენობის მიხედვით. თუ რიცხვი არ არის მოცემული, გამოიყენეთ 3 როგორც დეფოლტი.
let repeat = (text,num=3) => text.repeat(num);
console.log(repeat("nata"));

// 7 
// შექმენით arrow function, რომელიც იღებს ორი რიცხვს და აბრუნებს true თუ პირველი რიცხვი მეტია მეორეზე.
// თუ არ არის პარამეტრები, გამოიყენეთ 5 და 10 როგორც დეფოლტი.
 let bool = (n=5,m=10) => {
    return n > m;
}
console.log(bool());

// 8
// შექმენით arrow function, რომელიც იღებს ობიექტს, რომელშიც არის სახელი, ასაკი და ქალაქი.თუ რომელიმე პარამეტრი
// არ არის მოცემული, გამოიყენეთ მაია, 25 და თბილისი როგორც დეფოლტი მნიშვნელობები.ფუნქცია უნდა დააბრუნოს სტრინგი,
// რომელიც შეიცავს შემდეგ შინაარსს: "გამარჯობა, მე ვარ [სახელი], [ასაკი] წლის და მცხოვრები ვარ [ქალაქი]-ში."
let person = ({name="maia",age=25,city="Tbilisi"}={}) => 
    `გამარჯობა, მე ვარ ${name},${age} წლის და მცხოვრები ვარ ${city}-ის`

console.log(person());

// 9 
// შექმენით arrow function, რომელიც იღებს დასაწყისის რიცხვს, ბოლოს რიცხვს და ნაბიჯის ზომას. ფუნქცია უნდა დააბრუნოს ყველა
// რიცხვი იმ ინტერვალებში, მიცემული ნაბიჯის ზომით. თუ რომელიმე პარამეტრი არ არის მოცემული, გამოიყენეთ 1, 10 და 1 როგორც დეფოლტი.
let count = (start=1,end=10,step=1) => {
    for (let i=start; i < end+1; i+=step);
    console.log(i);
}
count();

// 10
// შექმენით arrow function, რომელიც იღებს ობიექტებს (ორ ან მეტს) და აბრუნებს მათ გაერთიანებულ მნიშვნელობებს
//  (რაც იმას ნიშნავს, რომ ყველა ობიექტის ყველა მახასიათებელი გაერთიანდება ერთ ობიექტში). თუ არ არის ობიექტი 
//  გადმოცემული, გამოიყენეთ ცარიელი ობიექტი {} როგორც დეფოლტი.